import home from '@/assets/home.svg';
import search from '@/assets/search.svg';
import heart from '@/assets/heart.svg';
import heartGray from '@/assets/heart-gray.svg';
import create from '@/assets/create.svg';
import community from '@/assets/community.svg';
import user from '@/assets/user.svg';
import reply from '@/assets/reply.svg';
import members from '@/assets/members.svg';
import tag from '@/assets/tag.svg';
import request from '@/assets/request.svg'

export const sidebarLinks = [
    {
      imgURL: home,
      route: "/",
      label: "Головна",
    },
    {
      imgURL: search,
      route: "/search",
      label: "Пошук",
    },
    // {
    //   imgURL: heart,
    //   route: "/activity",
    //   label: "Активність",
    // },
    {
      imgURL: create,
      route: "/create-post",
      label: "Створити пост",
    },
    {
      imgURL: community,
      route: "/communities",
      label: "Спільноти",
    },
    {
      imgURL: user,
      route: "/profile",
      label: "Профіль",
    },
  ];
  
  export const profileTabs = [
    { value: "posts", label: "Posts", icon: reply },
    { value: "replies", label: "Replies", icon: members },
    { value: "liked", label: "Liked", icon: heartGray },
  ];
  
  export const communityTabs = [
    { value: "posts", label: "Posts", icon: reply },
    { value: "members", label: "Members", icon: members },
    { value: "requests", label: "Requests", icon: request },
  ];

  export const textCreatedPost = ['Як пройшов день?', 'Що ви думайте?', 'Розкажіть цікаву історію?', 'Що сьогодні нового?', 'Розкажіть про вчорашній день?', 'Напишіть текст.',  'Які у вас плани на завтра?',  'Напишіть про нову книгу, яку прочитали', 'Напишіть про новий фільм, який переглянули', 'Напишіть про нову відеоігру, яку недавно пограли', 'Розкажіть історію з минулого', 'Напишіть пост про улюблену їжу', 'Що відбулось цікавого за тиждень?', 'Що ви нового дізналися сьогодні?', 'Як вам відеогра Minecraft', 'Які ваші думки про останні події?', 'Як пройшов вихідний?', 'Що вас найбільше вразило за останній тиждень?', 'Розкажіть про ваш останній подорож?', 'Які новини вас здивували найбільше?', 'Що ви вчора робили?', 'Які у вас хобі та захоплення?', 
  'Назвіть ваш улюблений фільм і чому він вам подобається?', 'Який ваш улюблений вид спорту?', 'Як ви відпочиваєте від стресу?', 'Що вас найбільше вражає в технологічних новинках?', 'Які ваші плани на наступний місяць?', 'Розкажіть про свої найкращі враження від останнього концерту, на якому ви були.', 'Які країни ви б хотіли відвідати у найближчому майбутньому?', 'Яка ваша улюблена страва і чому?', 'Як ви відзначаєте свій день народження?', 'Що ви сьогодні читали?', 'Розкажіть про своє найкраще спогади з дитинства.', 'Які ваші плани на цей тиждень?', 'Як ви відноситесь до фітнесу та здорового способу життя?', 'Назвіть книгу, яка вас найбільше вразила, і чому?', 'Розкажіть про своє улюблене місце на землі.', 'Як ви відпочиваєте під час відпустки?', 'Яке свято вам подобається найбільше і чому?', 
  'Чим ви захоплюєтеся в житті?', 'Як ви відсвяткували останнє свято?', 'Розкажіть про ваші найцікавіші враження від недавньої події.', 'Як ви ставитеся до творчості та мистецтва?', 'Як ви використовуєте свій вільний час?', 'Розкажіть про свою найбільшу досягнення за останній місяць.', 'Як ви обираєте місце для вечері у новому ресторані?', 'Яка пісня завжди піднімає вам настрій?', 'Як ви відзначаєте День святого Валентина?', 'Розкажіть про свої плани на вихідні.', 'Як ви реагуєте на негативні ситуації?', 'Як ви обираєте подарунки для своїх близьких?', 'Розкажіть про свій найкращий день у цьому місяці.', 'Як ви відзначаєте День матері чи День батька?', 'Як ви впораєтеся зі стресом на роботі?', 'Розкажіть про свої улюблені заняття на вільному повітрі.', 'Як ви відзначаєте свої досягнення?',
  'Як ви проводите свій вечір перед сном?', 'Розкажіть про свій останній кулінарний експеримент.', 'Як ви відзначаєте свій ювілей?', 'Яке ваше улюблене місце для відпочинку вдома?', 'Як ви плануєте свої вихідні?', 'Розкажіть про ваші враження від останньої подорожі.']